app/controllers/meals_controller.rb

SELECT "meals".* FROM "meals"
---
  def index
    @meals = Meal.all

SELECT  "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @meal = Meal.find(params[:id])

INSERT INTO "meals" ("name", "img_url", "category", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @meal = Meal.new(meal_params)
    if @meal.save