app/controllers/responses_controller.rb

    def index
        @responses = Response.all
---
SELECT "responses".* FROM "responses"