app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "AnsaraHooks"], ["created_at", "2019-05-09 19:11:44.380296"], ["updated_at", "2019-05-09 19:11:44.380296"]]
---
    def create
        @user = User.new(params)
        if  @user.valid?
            @user.save